app/Models/AdminPageModel.php

SELECT *
FROM `admin`
ORDER BY `NRP`
---
    public function tampilkan_data()
    {
        return $this
        ->select('*')
        ->db
        ->table($this->table)
        ->orderBy('NRP', 'Nama')
        ->get()
        ->getResult();

INSERT INTO `admin` (`NRP`, `Nama`) VALUES ('C14w', 'Admin 01')
---
    public function tambah_data($data){
        return $this->insert($data);